Обработки/Reports/_СписокЛицВходящихВПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СписокЛицВходящихВПеречень</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилищаXMLММВБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйФормат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьУволенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СписокЛицВходящихВПеречень/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Список лиц входящих в перечень",
		"0.18",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область ФормированиеОтчета

Процедура СформироватьОтчет(ДокументРезультат, ИдентификаторФормы) Экспорт
	
	// Организуем сбор статистики	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация,Период,Ответственный,ВидПеречня");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",		ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",			ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",		ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Ответственный",		ЭтотОбъект.Ответственный);
	Запрос.УстановитьПараметр("ВидПеречня",			ЭтотОбъект.ВидПеречня);
	Запрос.УстановитьПараметр("ПоказатьУволенных",	ЭтотОбъект.ПоказатьУволенных);
	
	ПоместитьСписокОбъектовВМВТ(Запрос);
	
	Если ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.Инсайдеры Тогда
		Инсайдеры_СформироватьОтчет(ДокументРезультат, ИдентификаторФормы, Запрос);
		
	Иначе
		Сотрудники_СформироватьОтчет(ДокументРезультат, ИдентификаторФормы, Запрос);
		
	КонецЕсли;	
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

КонецПроцедуры

Процедура Инсайдеры_СформироватьОтчет(ДокументРезультат, ИдентификаторФормы, Запрос)
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.ДатаВключения КАК ДатаВключения,
		|	ОснованияВключенияВПеречень.Основание КАК ОснованиеВключения,
		|	ВложенныйЗапрос.ДатаИсключения КАК ДатаИсключения,
		|	ОснованияИсключенияИзПереченя.Основание КАК ОснованиеИсключения
		|ПОМЕСТИТЬ _СписокОбъектовСОснованиями
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СписокОбъектов.Объект КАК Объект,
		|		_СписокОбъектов.ДатаВключения КАК ДатаВключения,
		|		_СписокОбъектов.ДатаИсключения КАК ДатаИсключения,
		|		МАКСИМУМ(ОснованияВключенияВПеречень.Период) КАК ДатаОснованияВключения
		|	ИЗ
		|		_СписокОбъектов КАК _СписокОбъектов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВключенияВПеречень
		|			ПО _СписокОбъектов.Объект = ОснованияВключенияВПеречень.Объект
		|				И (ОснованияВключенияВПеречень.Организация = &Организация)
		|				И (ОснованияВключенияВПеречень.ВидПеречня = &ВидПеречня)
		|				И (ОснованияВключенияВПеречень.Активность)
		|				И (ЕСТЬNULL(_СписокОбъектов.ДатаИсключения, &ДатаОкончания) > ОснованияВключенияВПеречень.Период)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СписокОбъектов.Объект,
		|		_СписокОбъектов.ДатаВключения,
		|		_СписокОбъектов.ДатаИсключения) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВключенияВПеречень
		|		ПО ВложенныйЗапрос.Объект = ОснованияВключенияВПеречень.Объект
		|			И ВложенныйЗапрос.ДатаОснованияВключения = ОснованияВключенияВПеречень.Период
		|			И (ОснованияВключенияВПеречень.Организация = &Организация)
		|			И (ОснованияВключенияВПеречень.Активность)
		|			И (ОснованияВключенияВПеречень.ВидПеречня = &ВидПеречня)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияИсключенияИзПереченя
		|		ПО ВложенныйЗапрос.Объект = ОснованияИсключенияИзПереченя.Объект
		|			И ВложенныйЗапрос.ДатаИсключения = ОснованияИсключенияИзПереченя.Период
		|			И (ОснованияИсключенияИзПереченя.Организация = &Организация)
		|			И (ОснованияИсключенияИзПереченя.Активность)
		|			И (ОснованияИсключенияИзПереченя.ВидПеречня = &ВидПеречня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка КАК Основание,
		|	МАКСИМУМ(ВнесениеИзмененийВоВнутреннийПереченьОснования.Сотрудник) КАК Сотрудник
		|ПОМЕСТИТЬ _СотрудникиИзОснований
		|ИЗ
		|	Документ.ВнесениеИзмененийВоВнутреннийПеречень.Основания КАК ВнесениеИзмененийВоВнутреннийПереченьОснования
		|ГДЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьОснования.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.)
		|	И ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеОрганизации,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации,
		|	""1 и 4"" КАК КатегорияИнсайдера,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН КАК ОГРН,
		|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Представление, РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮридическийАдрес) КАК ЮридическийАдрес,
		|	ЕСТЬNULL(КонтактнаяИнформацияФактАдрес.Представление, РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПочтовыйАдрес) КАК ПочтовыйАдрес,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Факсы КАК Факсы,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ВебСтраница КАК ВебСтраница,
		|	Ответственный.Фамилия + "" "" + Ответственный.Имя + "" "" + Ответственный.Отчество КАК Ответственный,
		|	&ВидПеречня КАК ВидПеречня
		|ПОМЕСТИТЬ _РеквизитыОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияЮрАдрес
		|		ПО (КонтактнаяИнформацияЮрАдрес.Объект = Организации.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдрес)) КАК КонтактнаяИнформацияФактАдрес
		|		ПО (КонтактнаяИнформацияФактАдрес.Объект = Организации.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ ПЕРВЫЕ 1
		|							Сотрудники.ЮрФизЛицо
		|						ИЗ
		|							Справочник.Сотрудники КАК Сотрудники
		|						ГДЕ
		|							Сотрудники.Ссылка = &Ответственный)) КАК Ответственный
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокОбъектовСОснованиями.Объект КАК Объект,
		|	ЕСТЬNULL(РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Имя + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, ЮрФизЛица.Наименование) КАК ФИО,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Имя КАК Имя,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество КАК Отчество,
		|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК ДатаРождения,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.МестоРождения КАК МестоРождения,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности,
		|	"""" КАК Телефон,
		|	"""" КАК EMail,
		|	"""" КАК АдресРегистрации,
		|	"""" КАК ПочтовыйАдрес,
		|	_СписокОбъектовСОснованиями.ДатаВключения КАК ДатаВключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения КАК ОснованиеВключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения КАК ОписаниеОснованияВключения,
		|	_СписокОбъектовСОснованиями.ДатаИсключения КАК ДатаИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеИсключения КАК ОснованиеИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеИсключения КАК ОписаниеОснованияИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения.ОбъектИнсайдерскойИнформации.ПолноеНаименование КАК ОбъектИнсайдерскойИнформации,
		|	ВЫБОР
		|		КОГДА РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо ЕСТЬ НЕ NULL 
		|			ТОГДА ""ФизическиеЛица_Строка""
		|		ИНАЧЕ ""ФизическиеЛица_Ошибка""
		|	КОНЕЦ КАК ИмяОбласти,
		|	ВЫБОР
		|		КОГДА РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо ЕСТЬ NULL
		|			ТОГДА ""Отсутсвуют реквизиты сотрудника""
		|	КОНЕЦ КАК ОписаниеОшибки,
		|	_РеквизитыОрганизации.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
		|	СотрудникиОрганизацииСрезПоследних.Должность КАК Должность,
		|	СотрудникиОрганизацииСрезПоследних.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ _ФизическиеЛица
		|ИЗ
		|	_СписокОбъектовСОснованиями КАК _СписокОбъектовСОснованиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _СписокОбъектовСОснованиями.Объект = ЮрФизЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СотрудникиИзОснований КАК _СотрудникиИзОснований
		|		ПО _СписокОбъектовСОснованиями.ОснованиеВключения = _СотрудникиИзОснований.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО _СписокОбъектовСОснованиями.Объект = РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО (_СотрудникиИзОснований.Сотрудник = СотрудникиОрганизацииСрезПоследних.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОрганизации КАК _РеквизитыОрганизации
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|	И _СотрудникиИзОснований.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СписокОбъектовСОснованиями.Объект,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, ЮрФизЛица.Наименование),
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество,
		|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ),
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Телефоны,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ПочтовыйАдрес,
		|	_СписокОбъектовСОснованиями.ДатаВключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения,
		|	_СписокОбъектовСОснованиями.ДатаИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения.ОбъектИнсайдерскойИнформации.ПолноеНаименование,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо ЕСТЬ НЕ NULL 
		|			ТОГДА ""ФизическиеЛица_Строка""
		|		ИНАЧЕ ""ФизическиеЛица_Ошибка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо ЕСТЬ NULL
		|			ТОГДА """"
		|	КОНЕЦ,
		|	_РеквизитыОрганизации.ПолноеНаименованиеОрганизации,
		|	""Член совета директоров"",
		|	""""
		|ИЗ
		|	_СписокОбъектовСОснованиями КАК _СписокОбъектовСОснованиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _СписокОбъектовСОснованиями.Объект = ЮрФизЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СотрудникиИзОснований КАК _СотрудникиИзОснований
		|		ПО _СписокОбъектовСОснованиями.ОснованиеВключения = _СотрудникиИзОснований.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _СписокОбъектовСОснованиями.Объект = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОрганизации КАК _РеквизитыОрганизации
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|	И _СотрудникиИзОснований.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокОбъектовСОснованиями.Объект КАК Объект,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРН,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КИО, """") КАК КИО,
		|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации.Код КАК ОКСМ,
		|	ЕСТЬNULL(КонтактнаяИнформация_ПочтовыйАдрес.Представление, """") КАК ПочтовыйАдрес,
		|	ЕСТЬNULL(КонтактнаяИнформация_ФактическийАдрес.Представление, """") КАК ФактическийАдрес,
		|	ЕСТЬNULL(ЕСТЬNULL(КонтактнаяИнформация_Телефон.Представление, РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны), """") КАК Телефон,
		|	ЕСТЬNULL(ЕСТЬNULL(КонтактнаяИнформация_Email.Представление, РеквизитыЮридическихЛицАнкетныеСрезПоследних.Email), """") КАК Email,
		|	ЕСТЬNULL(ЕСТЬNULL(КонтактнаяИнформация_ФактическийАдрес.Представление, КонтактнаяИнформация_ПочтовыйАдрес.Представление), """") КАК Адрес,
		|	_СписокОбъектовСОснованиями.ДатаВключения КАК ДатаВключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения КАК ОснованиеВключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения КАК ОписаниеОснованияВключения,
		|	_СписокОбъектовСОснованиями.ДатаИсключения КАК ДатаИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеИсключения КАК ОснованиеИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеИсключения КАК ОписаниеОснованияИсключения,
		|	_СписокОбъектовСОснованиями.ОснованиеВключения.ОбъектИнсайдерскойИнформации.ПолноеНаименование КАК ОбъектИнсайдерскойИнформации
		|ПОМЕСТИТЬ _ЮридическиеЛица
		|ИЗ
		|	_СписокОбъектовСОснованиями КАК _СписокОбъектовСОснованиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _СписокОбъектовСОснованиями.Объект = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО _СписокОбъектовСОснованиями.Объект = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдрес)) КАК КонтактнаяИнформация_ФактическийАдрес
		|		ПО _СписокОбъектовСОснованиями.Объект = КонтактнаяИнформация_ФактическийАдрес.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдрес)) КАК КонтактнаяИнформация_ПочтовыйАдрес
		|		ПО _СписокОбъектовСОснованиями.Объект = КонтактнаяИнформация_ПочтовыйАдрес.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон)) КАК КонтактнаяИнформация_Телефон
		|		ПО _СписокОбъектовСОснованиями.Объект = КонтактнаяИнформация_Телефон.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Email)) КАК КонтактнаяИнформация_Email
		|		ПО _СписокОбъектовСОснованиями.Объект = КонтактнаяИнформация_Email.Объект
		|ГДЕ
		|	ВЫРАЗИТЬ(_СписокОбъектовСОснованиями.Объект КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Основания.Ссылка КАК Ссылка,
		|	Основания.НормативныйАкт.Наименование КАК НормативныйАкт,
		|	Основания.Основание КАК Основание,
		|	Основания.Сотрудник КАК Сотрудник,
		|	Основания.Категория.Наименование КАК Категория
		|ПОМЕСТИТЬ _Основания
		|ИЗ
		|	Документ.ВнесениеИзмененийВоВнутреннийПеречень.Основания КАК Основания
		|ГДЕ
		|	Основания.Ссылка В
		|			(ВЫБРАТЬ
		|				_СписокОбъектовСОснованиями.ОснованиеВключения КАК ОснованиеВключения
		|			ИЗ
		|				_СписокОбъектовСОснованиями КАК _СписокОбъектовСОснованиями
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ
		|				_СписокОбъектовСОснованиями.ОснованиеИсключения
		|			ИЗ
		|				_СписокОбъектовСОснованиями КАК _СписокОбъектовСОснованиями)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокОбъектовСОснованиями.ОснованиеВключения КАК ОснованиеВключения,
		|	ОснованияВнесенияВПеречень.Период КАК Период,
		|	ОснованияВнесенияВПеречень.Основание.ВидИзменения КАК ВидИзменения,
		|	ОснованияВнесенияВПеречень.Основание КАК Основание
		|ПОМЕСТИТЬ _ИсторияИзменений
		|ИЗ
		|	_СписокОбъектовСОснованиями КАК _СписокОбъектовСОснованиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВнесенияВПеречень
		|		ПО _СписокОбъектовСОснованиями.Объект = ОснованияВнесенияВПеречень.Объект
		|			И (ОснованияВнесенияВПеречень.ВидПеречня = &ВидПеречня)
		|			И (ОснованияВнесенияВПеречень.Период МЕЖДУ _СписокОбъектовСОснованиями.ДатаВключения И ЕСТЬNULL(ДОБАВИТЬКДАТЕ(_СписокОбъектовСОснованиями.ДатаИсключения, СЕКУНДА, -1), &ДатаОкончания))";
#КонецОбласти
	
	Запрос.Выполнить();
	
	Инсайдеры_ЗаполнитьПечатнуюФорму(ДокументРезультат, Запрос);
	Инсайдеры_СформироватьXML(Запрос, ИдентификаторФормы);
	
КонецПроцедуры

Процедура Сотрудники_СформироватьОтчет(ДокументРезультат, ИдентификаторФормы, Запрос)
	
	Если ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР
	 ИЛИ ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаПН	Тогда
		ИмяМакета = "Сотрудники";
	Иначе
		ИмяМакета = "ФизЛица";
	КонецЕсли;
		
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеОрганизации,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания,
		|	&ВидПеречня КАК ВидПеречня
		|ПОМЕСТИТЬ _РеквизитыОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.ДатаВключения КАК ДатаВключения,
		|	ВложенныйЗапрос.ДатаИсключения КАК ДатаИсключения,
		|	ОснованияВнесенияВПеречень.Основание КАК Основание
		|ПОМЕСТИТЬ _ПоследниеОснования
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СписокОбъектов.Объект КАК Объект,
		|		_СписокОбъектов.ДатаВключения КАК ДатаВключения,
		|		_СписокОбъектов.ДатаИсключения КАК ДатаИсключения,
		|		МАКСИМУМ(ОснованияВнесенияВПеречень.Период) КАК ДатаПоследнегоОснования
		|	ИЗ
		|		_СписокОбъектов КАК _СписокОбъектов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВнесенияВПеречень
		|			ПО (ОснованияВнесенияВПеречень.Организация = &Организация)
		|				И _СписокОбъектов.Объект = ОснованияВнесенияВПеречень.Объект
		|				И (ОснованияВнесенияВПеречень.ВидПеречня = &ВидПеречня)
		|				И (ОснованияВнесенияВПеречень.Период <= ЕСТЬNULL(ДОБАВИТЬКДАТЕ(_СписокОбъектов.ДатаИсключения, СЕКУНДА, -1), &ДатаОкончания))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СписокОбъектов.Объект,
		|		_СписокОбъектов.ДатаВключения,
		|		_СписокОбъектов.ДатаИсключения) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВнесенияВПеречень
		|		ПО (ОснованияВнесенияВПеречень.Организация = &Организация)
		|			И ВложенныйЗапрос.Объект = ОснованияВнесенияВПеречень.Объект
		|			И (ОснованияВнесенияВПеречень.ВидПеречня = &ВидПеречня)
		|			И (ОснованияВнесенияВПеречень.Период = ВложенныйЗапрос.ДатаПоследнегоОснования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокОбъектов.Объект КАК ЮрФизЛицо,
		|	_СписокОбъектов.ДатаВключения КАК ДатаВключения,
		|	_СписокОбъектов.ДатаИсключения КАК ДатаИсключения,
		|	Основания.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(СотрудникиОрганизацииСрезПоследних.Должность, Основания.ДолжностьЧленаСоветаДиректоров) КАК Должность,
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизацииСрезПоследних.Подразделение ЕСТЬ НЕ NULL 
		|			ТОГДА СотрудникиОрганизацииСрезПоследних.Подразделение
		|		КОГДА Основания.ДолжностьЧленаСоветаДиректоров ЕСТЬ НЕ NULL 
		|			ТОГДА ""Совет директоров""
		|	КОНЕЦ КАК Подразделение,
		|	ЕСТЬNULL(СотрудникиОрганизацииСрезПоследних.ВидСобытия, """") = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение) КАК Уволен,
		|	ЕСТЬNULL(РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия, РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия) + "" "" + ЕСТЬNULL(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя) + "" "" + ЕСТЬNULL(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество) КАК ФИО,
		|	СотрудникиПриемНаРаботу.Период КАК ДатаПриемаНаРаботу,
		|	ВЫБОР ЕСТЬNULL(СотрудникиОрганизацииСрезПоследних.ВидСобытия, """")
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА СотрудникиОрганизацииСрезПоследних.Период
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаУвольнения
		|ПОМЕСТИТЬ _СписокОбъектовДолжностныЛиц
		|ИЗ
		|	_СписокОбъектов КАК _СписокОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеОснования КАК _ПоследниеОснования
		|		ПО _СписокОбъектов.Объект = _ПоследниеОснования.Объект
		|			И _СписокОбъектов.ДатаВключения = _ПоследниеОснования.ДатаВключения
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВнесениеИзмененийВоВнутреннийПеречень.Ссылка КАК Основание,
		|			ВнесениеИзмененийВоВнутреннийПеречень.ДолжностьЧленаСоветаДиректоров КАК ДолжностьЧленаСоветаДиректоров,
		|			NULL КАК Сотрудник
		|		ИЗ
		|			Документ.ВнесениеИзмененийВоВнутреннийПеречень КАК ВнесениеИзмененийВоВнутреннийПеречень
		|		ГДЕ
		|			ВнесениеИзмененийВоВнутреннийПеречень.Организация = &Организация
		|			И ВнесениеИзмененийВоВнутреннийПеречень.ВидПеречня = &ВидПеречня
		|			И ВнесениеИзмененийВоВнутреннийПеречень.ДолжностьЧленаСоветаДиректоров <> ЗНАЧЕНИЕ(Справочник.Должности.)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка,
		|			NULL,
		|			ВнесениеИзмененийВоВнутреннийПереченьОснования.Сотрудник
		|		ИЗ
		|			Документ.ВнесениеИзмененийВоВнутреннийПеречень.Основания КАК ВнесениеИзмененийВоВнутреннийПереченьОснования
		|		ГДЕ
		|			ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка.Организация = &Организация
		|			И ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка.ВидПеречня = &ВидПеречня
		|			И ВнесениеИзмененийВоВнутреннийПереченьОснования.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.)) КАК Основания
		|		ПО (_ПоследниеОснования.Основание = Основания.Основание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО (Основания.Сотрудник = СотрудникиОрганизацииСрезПоследних.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО _СписокОбъектов.Объект = РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _СписокОбъектов.Объект = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПервых(, Организация = &Организация) КАК СотрудникиПриемНаРаботу
		|		ПО (Основания.Сотрудник = СотрудникиПриемНаРаботу.Сотрудник)
		|ГДЕ
		|	(&ПоказатьУволенных
		|			ИЛИ СотрудникиОрганизацииСрезПоследних.ВидСобытия ЕСТЬ NULL
		|			ИЛИ СотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение))";
#КонецОбласти
	
	Запрос.Выполнить();
	
	Таблица_РеквизитыОрганизации		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыОрганизации").ПолучитьДанные().Выгрузить();
	Таблица_СписокОбъектовДолжностныЛиц	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СписокОбъектовДолжностныЛиц").ПолучитьДанные().Выгрузить();
	
	Если Таблица_РеквизитыОрганизации.Количество() Тогда
		ВывестиОбласть(ДокументРезультат, ИмяМакета, "Шапка", Инсайдеры_ПодготовитьДанные(Таблица_РеквизитыОрганизации[0]));
	КонецЕсли;
	
	Таблица_СписокОбъектовДолжностныЛиц.Сортировать("ФИО");
	Если Таблица_СписокОбъектовДолжностныЛиц.Количество() Тогда
		Для Каждого Строка_СписокОбъектовДолжностныЛиц Из Таблица_СписокОбъектовДолжностныЛиц Цикл
			ВывестиОбласть(ДокументРезультат, ИмяМакета, "Строка", Строка_СписокОбъектовДолжностныЛиц, Новый Структура("Использование, ЦветТекста", Строка_СписокОбъектовДолжностныЛиц.Уволен, Новый Цвет(169, 169, 169)));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоместитьСписокОбъектовВМВТ(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеПеречниСрезПоследних.Объект КАК Объект,
		|	ВнутренниеПеречниСрезПоследних.Период КАК ДатаВключения
		|ПОМЕСТИТЬ _ВключениеВПеречень
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни.СрезПоследних(
		|			&ДатаНачала,
		|			Организация = &Организация
		|				И ВидПеречня = &ВидПеречня) КАК ВнутренниеПеречниСрезПоследних
		|ГДЕ
		|	ВнутренниеПеречниСрезПоследних.Действует
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВнутренниеПеречни.Объект,
		|	ВнутренниеПеречни.Период
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни КАК ВнутренниеПеречни
		|ГДЕ
		|	ВнутренниеПеречни.Период > &ДатаНачала
		|	И ВнутренниеПеречни.Период <= &ДатаОкончания
		|	И ВнутренниеПеречни.Организация = &Организация
		|	И ВнутренниеПеречни.ВидПеречня = &ВидПеречня
		|	И ВнутренниеПеречни.Активность
		|	И ВнутренниеПеречни.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеПеречни.Объект КАК Объект,
		|	ВнутренниеПеречни.Период КАК ДатаИсключения
		|ПОМЕСТИТЬ _ИсключениеИзПереченя
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни КАК ВнутренниеПеречни
		|ГДЕ
		|	ВнутренниеПеречни.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВнутренниеПеречни.Организация = &Организация
		|	И ВнутренниеПеречни.ВидПеречня = &ВидПеречня
		|	И ВнутренниеПеречни.Активность
		|	И НЕ ВнутренниеПеречни.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВключениеВПеречень.Объект КАК Объект,
		|	_ВключениеВПеречень.ДатаВключения КАК ДатаВключения,
		|	МИНИМУМ(_ИсключениеИзПереченя.ДатаИсключения) КАК ДатаИсключения
		|ПОМЕСТИТЬ _СписокОбъектов
		|ИЗ
		|	_ВключениеВПеречень КАК _ВключениеВПеречень
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИсключениеИзПереченя КАК _ИсключениеИзПереченя
		|		ПО _ВключениеВПеречень.Объект = _ИсключениеИзПереченя.Объект
		|			И _ВключениеВПеречень.ДатаВключения <= _ИсключениеИзПереченя.ДатаИсключения
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВключениеВПеречень.Объект,
		|	_ВключениеВПеречень.ДатаВключения";
	
	Запрос.Выполнить();
	
КонецПроцедуры


#КонецОбласти

#Область Инсайдеры_ЗаполнитьПечатнуюФорму

Процедура Инсайдеры_ЗаполнитьПечатнуюФорму(ДокументРезультат, Запрос) 
	
	ДокументРезультат.Очистить();
	
	ИмяМакета = "СписокИнсайдеров";
	
	Таблица_РеквизитыОрганизации	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыОрганизации").ПолучитьДанные().Выгрузить();
	Таблица_ФизическиеЛица			= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ФизическиеЛица").ПолучитьДанные().Выгрузить();
	Таблица_ЮридическиеЛица 		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ЮридическиеЛица").ПолучитьДанные().Выгрузить();
	Таблица_Основания				= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Основания").ПолучитьДанные().Выгрузить();
	Таблица_ИсторияИзменений		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ИсторияИзменений").ПолучитьДанные().Выгрузить();
	
	Если Таблица_РеквизитыОрганизации.Количество() Тогда
		ВывестиОбласть(ДокументРезультат, ИмяМакета, "Шапка", Инсайдеры_ПодготовитьДанные(Таблица_РеквизитыОрганизации[0]));
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Таблица_Основания, Таблица_ИсторияИзменений", Таблица_Основания, Таблица_ИсторияИзменений);
	
	Если Таблица_ФизическиеЛица.Количество() Тогда
		Таблица_ФизическиеЛица.Сортировать("ФИО");
		ВывестиОбласть(ДокументРезультат, ИмяМакета, "ФизическиеЛица");
		Для Каждого Строка_ФизическиеЛица Из Таблица_ФизическиеЛица Цикл
			ВывестиОбласть(ДокументРезультат, ИмяМакета, Строка_ФизическиеЛица.ИмяОбласти, Инсайдеры_ПодготовитьДанные(Строка_ФизическиеЛица, ДополнительныеПараметры));
		КонецЦикла;
	КонецЕсли;
	
	Если Таблица_ЮридическиеЛица.Количество() Тогда
		Таблица_ЮридическиеЛица.Сортировать("ПолноеНаименованиеПоУставу");
		ВывестиОбласть(ДокументРезультат, ИмяМакета, "ЮридическиеЛица");
		Для Каждого Строка_ЮридическиеЛица Из Таблица_ЮридическиеЛица Цикл
			ВывестиОбласть(ДокументРезультат, ИмяМакета, "ЮридическиеЛица_Строка", Инсайдеры_ПодготовитьДанные(Строка_ЮридическиеЛица, ДополнительныеПараметры));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция Инсайдеры_ПодготовитьДанные(СтрокаДанных, ДополнительныеПараметры = Неопределено)
	
	Колонки = СтрокаДанных.Владелец().Колонки;
	Данные	= Новый Структура;
	
	Для Каждого Колонка Из Колонки Цикл
		Значение = СтрокаДанных[Колонка.Имя];
		
		Если ТипЗнч(Значение) = Тип("Дата") Тогда
			Значение = Формат(Значение, "ДФ=dd.MM.yyyy");
		ИначеЕсли Колонка.Имя = "ОписаниеОснованияВключения"
		 ИЛИ Колонка.Имя = "ОписаниеОснованияИсключения" Тогда
			Значение = Инсайдеры_ПолучитьОписаниеОснования(Значение, ДополнительныеПараметры.Таблица_Основания);
		ИначеЕсли Колонка.Имя = "ОснованиеВключения" Тогда
			Значение = Инсайдеры_ПолучитьИсториюИзменений(Значение, ДополнительныеПараметры.Таблица_ИсторияИзменений);
		КонецЕсли;
		
		Данные.Вставить(Колонка.Имя, Значение);
	КонецЦикла;	
	
	Возврат Данные;
	
КонецФункции

Функция Инсайдеры_ПолучитьОписаниеОснования(Основание, Таблица_Основания)
	
	ОписаниеОснования = Новый Массив;
	
	ПараметрыПоиска = Новый Структура("Ссылка", Основание);	
	НайденныеСтроки = Таблица_Основания.НайтиСтроки(ПараметрыПоиска);
	
	Для Каждого Строка_Основания Из НайденныеСтроки Цикл
		ОписаниеОснования.Добавить(Строка(Строка_Основания.Категория));
		ОписаниеОснования.Добавить(Строка(Строка_Основания.Основание));
	КонецЦикла;
	
	Возврат СтрСоединить(ОписаниеОснования, Символы.ПС);
	
КонецФункции

Функция Инсайдеры_ПолучитьИсториюИзменений(Основание, Таблица_ИсторияИзменений)
	
	СписокОснований = Новый СписокЗначений;
	
	ПараметрыПоиска = Новый Структура("ОснованиеВключения", Основание);	
	НайденныеСтроки = Таблица_ИсторияИзменений.НайтиСтроки(ПараметрыПоиска);
	
	Для Каждого Строка_ИсторияИзменений Из НайденныеСтроки Цикл
		СписокОснований.Добавить(Строка_ИсторияИзменений.Основание, Строка(Строка_ИсторияИзменений.ВидИзменения) + " " +  Формат(Строка_ИсторияИзменений.Период, "ДФ=dd.MM.yyyy"));
	КонецЦикла;
	
	СписокОснований.СортироватьПоЗначению();
	Возврат СписокОснований;
	
КонецФункции

Процедура ВывестиОбласть(Результат, ИмяМакета, ИмяОбласти, Данные = Неопределено, Оформление = Неопределено)
	
	Макет	= ПолучитьМакет(ИмяМакета);
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	
	Если Данные <> Неопределено Тогда
		Область.Параметры.Заполнить(Данные);
	КонецЕсли;
	
	Результат.Вывести(Область);
	
	Если Оформление <> Неопределено И Оформление.Использование Тогда
		ВыведеннаяОбласть = Результат.Область(Результат.ВысотаТаблицы, 1, Результат.ВысотаТаблицы, Результат.ШиринаСтраницы);
		Для Каждого ЭлементОформления Из Оформление Цикл
			Если ЭлементОформления.Ключ <> "Использование" Тогда
				ВыведеннаяОбласть[ЭлементОформления.Ключ] = ЭлементОформления.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область Инсайдеры_СформироватьXML

Процедура Инсайдеры_СформироватьXML(Запрос, ИдентификаторФормы)
	
	МассивОшибок = Новый Массив;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
	Если ЭтотОбъект.НовыйФормат Тогда
		ПолучитьМакет("СхемаММВБ2025").Записать(ИмяВременногоФайла);
	Иначе
		ПолучитьМакет("СхемаММВБ").Записать(ИмяВременногоФайла);
	КонецЕсли;
	
	МассивXSD = Новый Массив;
	МассивXSD.Добавить(ИмяВременногоФайла);
	
	НоваяФабрикаXDTO = СоздатьФабрикуXDTO(МассивXSD);
	
	URIПространстваИмен = "http://www.micex.ru/insiders_document";

	insiders_document							= НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "insiders_document"));
	insiders_document.insiders					= НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "insiders"));
	insiders_document.insiders.organizations	= НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "organizations"));
	insiders_document.insiders.persons			= НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "persons"));
	
	Таблица_РеквизитыОрганизации	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыОрганизации").ПолучитьДанные().Выгрузить();
	Таблица_ФизическиеЛица			= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ФизическиеЛица").ПолучитьДанные().Выгрузить();
	Таблица_ЮридическиеЛица 		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ЮридическиеЛица").ПолучитьДанные().Выгрузить();
	Таблица_Основания				= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Основания").ПолучитьДанные().Выгрузить();
	
	insiders_document.created = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyy-MM-dd");
	//Если ЭтотОбъект.НовыйФормат Тогда
	//	insiders_document.date = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyy-MM-dd");
	//КонецЕсли;
	
	Для Каждого Строка_РеквизитыОрганизации Из Таблица_РеквизитыОрганизации Цикл
		organization_info = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "organization_info"));
		
		organization_info.full_name			= Строка_РеквизитыОрганизации.ПолноеНаименованиеОрганизации;
		organization_info.short_name		= Строка_РеквизитыОрганизации.НаименованиеОрганизации;
		organization_info.category			= Строка_РеквизитыОрганизации.КатегорияИнсайдера;
		organization_info.inn				= Строка_РеквизитыОрганизации.ИНН;
		organization_info.ogrn				= Строка_РеквизитыОрганизации.ОГРН;
		organization_info.address			= Строка_РеквизитыОрганизации.ЮридическийАдрес;
		Если Строка_РеквизитыОрганизации.ПочтовыйАдрес <> Строка_РеквизитыОрганизации.ЮридическийАдрес Тогда
			organization_info.post_address		= Строка_РеквизитыОрганизации.ПочтовыйАдрес;
		КонецЕсли;
		organization_info.website_address	= Строка_РеквизитыОрганизации.ВебСтраница;
		organization_info.contact_person	= Строка(Строка_РеквизитыОрганизации.Ответственный);
		organization_info.phone				= Строка_РеквизитыОрганизации.Телефоны;
		organization_info.fax				= Строка_РеквизитыОрганизации.Факсы;
		organization_info.email				= Строка_РеквизитыОрганизации.EMail;
		
		insiders_document.organization_info = organization_info;
		
		Если ПустаяСтрока(Строка_РеквизитыОрганизации.Ответственный) Тогда
			МассивОшибок.Добавить("Не указан ответственный");
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого Строка_ЮридическиеЛица Из Таблица_ЮридическиеЛица Цикл
		organization = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "organization"));
		
		organization.name						= Строка_ЮридическиеЛица.ПолноеНаименованиеПоУставу;
		organization.inn						= Строка_ЮридическиеЛица.ИНН;
		organization.ogrn						= Строка_ЮридическиеЛица.ОГРН;
		Если ЭтотОбъект.НовыйФормат Тогда
			organization.kio						= Строка_ЮридическиеЛица.КИО;
			organization.okcm						= Строка_ЮридическиеЛица.ОКСМ;
			organization.registration_number		= ""; //тех.долг
			//Следующие данные не запрашиваются, выгружать не надо
			//organization.address					= ""; //Строка_ЮридическиеЛица.Адрес;
			//organization.post_address				= ""; //Строка_ЮридическиеЛица.ПочтовыйАдрес;
			//organization.phone						= ""; //Строка_ЮридическиеЛица.Телефон;
			//organization.email						= ""; //Строка_ЮридическиеЛица.Email;
		КонецЕсли;
		organization.inc_date					= Формат(Строка_ЮридическиеЛица.ДатаВключения, "ДФ=yyyy-MM-dd");
		organization.inc_reason					= Инсайдеры_ПолучитьОснованиеИнсайдераИзОснования(Строка_ЮридическиеЛица.ОснованиеВключения, Таблица_Основания);
		organization.inc_category				= Инсайдеры_ПолучитьКатегориюИнсайдераИзОснования(Строка_ЮридическиеЛица.ОснованиеВключения, Таблица_Основания);
		organization.inc_financial_instrument	= Строка(Строка_ЮридическиеЛица.ОбъектИнсайдерскойИнформации);
		
		Если ЗначениеЗаполнено(Строка_ЮридическиеЛица.ДатаИсключения) Тогда
			organization.exc_date					= Формат(Строка_ЮридическиеЛица.ДатаИсключения, "ДФ=yyyy-MM-dd");
			organization.exc_reason					= Инсайдеры_ПолучитьОснованиеИнсайдераИзОснования(Строка_ЮридическиеЛица.ОснованиеИсключения, Таблица_Основания);
			organization.exc_category				= Инсайдеры_ПолучитьКатегориюИнсайдераИзОснования(Строка_ЮридическиеЛица.ОснованиеИсключения, Таблица_Основания);
			organization.exc_financial_instrument	= Строка(Строка_ЮридическиеЛица.ОбъектИнсайдерскойИнформации);
		КонецЕсли;
		
		insiders_document.insiders.organizations.organization.Добавить(organization);
		
	КонецЦикла;
	
	Для Каждого Строка_ФизическиеЛица Из Таблица_ФизическиеЛица Цикл
		person_inc = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "person"));
		
		person_inc.last_name				= Строка(Строка_ФизическиеЛица.Фамилия);
		person_inc.first_name				= Строка(Строка_ФизическиеЛица.Имя);
		person_inc.middle_name				= Строка(Строка_ФизическиеЛица.Отчество);
		person_inc.doc_sn					= Строка(Строка_ФизическиеЛица.СерияУдостоверенияЛичности) + Строка(Строка_ФизическиеЛица.НомерУдостоверенияЛичности);
		
		Если ЭтотОбъект.НовыйФормат Тогда
			person_inc.birth_date				= Дата(Строка_ФизическиеЛица.ДатаРождения);
			//Следующие данные не запрашиваются, выгружать не надо
			//person_inc.birth_place				= ""; //Строка(Строка_ФизическиеЛица.МестоРождения);
			//person_inc.doc_organ				= ""; //Строка(Строка_ФизическиеЛица.ОрганВыдавшийУдостоверениеЛичности);
			//person_inc.address					= ""; //Строка(Строка_ФизическиеЛица.АдресРегистрации);
			//person_inc.post_address				= ""; //Строка(Строка_ФизическиеЛица.ПочтовыйАдрес);
			//person_inc.phone					= ""; //Строка(Строка_ФизическиеЛица.Телефон);
			//person_inc.email					= ""; //Строка(Строка_ФизическиеЛица.EMail);
		КонецЕсли;
		
		person_inc.inc_date					= Формат(Строка_ФизическиеЛица.ДатаВключения, "ДФ=yyyy-MM-dd");
		person_inc.inc_reason				= Инсайдеры_ПолучитьОснованиеИнсайдераИзОснования(Строка_ФизическиеЛица.ОснованиеВключения, Таблица_Основания);
		person_inc.inc_category				= Инсайдеры_ПолучитьКатегориюИнсайдераИзОснования(Строка_ФизическиеЛица.ОснованиеВключения, Таблица_Основания);
		person_inc.inc_financial_instrument	= Строка(Строка_ФизическиеЛица.ОбъектИнсайдерскойИнформации);
		
		person_inc.inc_org_fullname			= Строка_ФизическиеЛица.ПолноеНаименованиеОрганизации;
		Если Не ЭтотОбъект.НовыйФормат Тогда
			person_inc.inc_job					= Строка(Строка_ФизическиеЛица.Должность) + ?(ЗначениеЗаполнено(Строка_ФизическиеЛица.Подразделение), "", " ") + Строка(Строка_ФизическиеЛица.Подразделение);
			person_inc.inc_type					= "";
		КонецЕсли;
		
		insiders_document.insiders.persons.person.Добавить(person_inc);
		
		Если ЗначениеЗаполнено(Строка_ФизическиеЛица.ДатаИсключения) Тогда
			person_exc = НоваяФабрикаXDTO.Создать(НоваяФабрикаXDTO.Тип(URIПространстваИмен, "person"));
			
			Если ЭтотОбъект.НовыйФормат Тогда
				ЗаполнитьЗначенияСвойств(person_exc, person_inc, "last_name, first_name, middle_name, doc_sn, inc_date, inc_reason, inc_category, inc_financial_instrument, inc_org_fullname, birth_date"); //birth_place, doc_organ, address, post_address, phone, email
			Иначе
				ЗаполнитьЗначенияСвойств(person_exc, person_inc, "doc_sn, inc_date, inc_reason, inc_category, inc_financial_instrument, inc_org_fullname, inc_job, inc_type");
			КонецЕсли;
			
			person_exc.exc_date					= Формат(Строка_ФизическиеЛица.ДатаИсключения, "ДФ=yyyy-MM-dd");
			person_exc.exc_reason				= Инсайдеры_ПолучитьОснованиеИнсайдераИзОснования(Строка_ФизическиеЛица.ОснованиеИсключения, Таблица_Основания);
			person_exc.exc_category				= Инсайдеры_ПолучитьКатегориюИнсайдераИзОснования(Строка_ФизическиеЛица.ОснованиеИсключения, Таблица_Основания);
			person_exc.exc_financial_instrument	= Строка(Строка_ФизическиеЛица.ОбъектИнсайдерскойИнформации);
			person_exc.exc_org_fullname			= Строка_ФизическиеЛица.ПолноеНаименованиеОрганизации;
			person_exc.exc_job					= Строка(Строка_ФизическиеЛица.Должность) + ?(ЗначениеЗаполнено(Строка_ФизическиеЛица.Подразделение), "", " ") + Строка(Строка_ФизическиеЛица.Подразделение);
			
			insiders_document.insiders.persons.person.Добавить(person_exc);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка_ФизическиеЛица.ОписаниеОшибки) Тогда
			МассивОшибок.Добавить(Строка_ФизическиеЛица.ОписаниеОшибки + ": " + Строка(Строка_ФизическиеЛица.Объект));
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивОшибок.Количество() Тогда
		ЭтотОбъект.АдресХранилищаXMLММВБ = ПоместитьВоВременноеХранилище(МассивОшибок, ИдентификаторФормы);
		
	Иначе		
	
		ИмяФайлаXML = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяФайлаXML, "windows-1251");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		НоваяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, insiders_document, "insiders_document");
		
		ЗаписьXML.Закрыть();
		
		//ТекстовыйФайл = Новый ТекстовыйДокумент;
		//ТекстовыйФайл.Прочитать(ИмяФайлаXML,"windows-1251");
		//ТекстовыйФайл.ЗаменитьСтроку(2, СтрЗаменить(ТекстовыйФайл.ПолучитьСтроку(2), "xmlns=""XBRL"" ", ""));
		//ТекстовыйФайл.Записать(ИмяФайлаXML,"windows-1251");
		
		ЭтотОбъект.АдресХранилищаXMLММВБ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаXML), ИдентификаторФормы);
		
	КонецЕсли;
	
КонецПроцедуры

Функция Инсайдеры_ПолучитьКатегориюИнсайдераИзОснования(Основание, Таблица_Основания)
	
	ОписаниеОснования = Новый Массив;
	
	ПараметрыПоиска = Новый Структура("Ссылка", Основание);	
	НайденныеСтроки = Таблица_Основания.НайтиСтроки(ПараметрыПоиска);
	
	Для Каждого Строка_Основания Из НайденныеСтроки Цикл
		ОписаниеОснования.Добавить(Строка(Строка_Основания.Категория));
	КонецЦикла;
	
	Возврат СтрСоединить(ОписаниеОснования, Символы.ПС);
	
КонецФункции

Функция Инсайдеры_ПолучитьОснованиеИнсайдераИзОснования(Основание, Таблица_Основания)
	
	ОписаниеОснования = Новый Массив;
	
	ПараметрыПоиска = Новый Структура("Ссылка", Основание);	
	НайденныеСтроки = Таблица_Основания.НайтиСтроки(ПараметрыПоиска);
	
	Для Каждого Строка_Основания Из НайденныеСтроки Цикл
		ОписаниеОснования.Добавить(Строка(Строка_Основания.Основание));
	КонецЦикла;
	
	Возврат СтрСоединить(ОписаниеОснования, Символы.ПС);
	
КонецФункции
	
#КонецОбласти
